acsandmann/tap/rift
age
arimxyer/tap/models
ast-grep
automake
bat
bat-extras
black
bookokrat
btop
ccls
chafa
chawan
chroma
clipboard
clisp
clojure
clojure-lsp
cmake
cmake-docs
context7-mcp
coreutils
cpanminus
csvlens
ctags-lsp
direnv
dive
docutils
dos2unix
elixir-ls
exiftool
expat
eza
fastfetch
fd
felinks
felixkratz/formulae/borders
figlet
file-formula
findent
folderify
fortran-language-server
fpc
fzf
fzy
gh
ghc
git
git-delta
git-filter-repo
glow
gnu-sed
go
gopls
gromgit/brewtils/taproom
harper
haskell-language-server
haskell-stack
hstr
httrack
hub
huggingface-cli
hyperfine
javacc
jdtls
jq
lazydocker
lazygit
lazyjournal
lazysql
libsixel
llmfit
lnav
lolcat
lsd
ltex-ls-plus
lua-language-server
luarocks
mariadb
markdown-toc
markdownlint-cli2
mas
mosh
multitail
neovim
ocaml
ocrmypdf
odin
oh-my-posh
ollama
opam
opencode
opencv
pandoc
perl
php
pipx
pnpm
poppler
prettier
prettierd
pyenv
pygments
pyright
python@3.12
python@3.13
qmk/qmk/qmk
rage
reattach-to-user-namespace
rtk-ai/tap/rtk
ruby-lsp
rust-analyzer
rustc-completion
rustup
scala
sevenzip
shfmt
solargraph
sphinx-doc
sqlfluff
superfile
swift
tabiew
taskopen
taskwarrior-tui
tenere
timewarrior
tmux
transmission-cli
tree
tree-sitter
tree-sitter-cli
trippy
turso
typescript-language-server
uv
viu
vivid
vttest
wget
wordnet
xclip
xcsift
xsel
yarn
yazi
yq
yt-dlp
zig
zip
zoxide
zsh
zsh-autosuggestions
zsh-fast-syntax-highlighting
zsh-history-substring-search
zsh-vi-mode
