1password
1password-cli
adobe-acrobat-reader
alacritty
alfred
backblaze
calibre
chronosync
daisydisk
devonagent
devonthink
discord
dropbox
epic-games
espanso
firefox
fork
google-chrome
google-drive
grammarly-desktop
iterm2
jabra-direct
jordanbaird-ice
karabiner-elements
keyboard-maestro
keycue
kitty
logi-options+
lulu
mactex
miniconda
moom
notion
obsidian
omnifocus
omnigraffle
omnioutliner
omniplan
only-switch
plus42-decimal
qmk-toolbox
setapp
sf-symbols
snagit
soundsource
spamsieve
steam
tageditor
tradingview
transmission
transmit
trezor-suite
vlc
wezterm
wins
zed
