age
ast-grep
automake
bat
bat-extras
black
broot
btop
busted
chafa
chroma
cmake
cmake-docs
composer
deno
direnv
docutils
fastfetch
fd
felixkratz/formulae/borders
figlet
findent
fish
fzf
fzy
gh
git
git-delta
gitui
glow
gnu-sed
go
httrack
hub
julia
koekeishiya/formulae/yabai
lazydocker
lazygit
lnav
lolcat
luarocks
markdown-toc
markdownlint-cli2
mas
mosh
multitail
neovim
ocaml
oh-my-posh
opam
pandoc
perl
pipx
pnpm
prettier
prettierd
pyenv
pygments
qmk/qmk/qmk
rage
reattach-to-user-namespace
ripgrep
ruby
rust
rust-analyzer
rustc-completion
shfmt
sphinx-doc
sqlfluff
tabiew
taskopen
taskwarrior-tui
television
terraform
the_silver_searcher
timewarrior
tmux
transmission-cli
tree
trippy
universal-ctags
utf8proc
uv
viu
vttest
wget
yarn
yazi
yq
zig
zip
zoxide
zsh
