tap "brewforge/extras"
tap "felixkratz/formulae"
tap "koekeishiya/formulae"
tap "netmute/tap"
tap "osx-cross/arm"
tap "osx-cross/avr"
tap "qmk/qmk"
tap "shaunsingh/sfmono-nerd-font-ligaturized"
tap "specstoryai/tap"
# Simple, modern, secure file encryption
brew "age"
# Code searching, linting, rewriting
brew "ast-grep"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Bash scripts that integrate bat with various command-line tools
brew "bat-extras"
# Python code formatter
brew "black"
# Terminal EPUB Book Reader
brew "bookokrat"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# C/C++/ObjC language server
brew "ccls"
# GNU compiler collection
brew "gcc"
# LLVM's OpenMP runtime library
brew "libomp"
# Versatile and fast Unicode/ASCII/ANSI graphics renderer
brew "chafa"
# General purpose syntax highlighter in pure Go
brew "chroma"
# Cut, copy, and paste anything, anywhere, all from the terminal
brew "clipboard"
# Cross-platform make
brew "cmake"
# Documentation for CMake
brew "cmake-docs"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Maintained ctags implementation
brew "universal-ctags"
# LSP implementation using universal-ctags as backend
brew "ctags-lsp"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Secure runtime for JavaScript and TypeScript
brew "deno"
# Load/unload environment variables based on $PWD
brew "direnv"
# Tool for exploring each layer in a docker image
brew "dive"
# Text processing system for reStructuredText
brew "docutils"
# Convert text between DOS, UNIX, and Mac formats
brew "dos2unix"
# Perl lib for reading and writing EXIF metadata
brew "exiftool"
# XML 1.0 parser
brew "expat"
# Like neofetch, but much faster because written mostly in C
brew "fastfetch"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Banner-like program prints strings as ASCII art
brew "figlet"
# Utility to determine file types
brew "file-formula"
# Indent and beautify Fortran sources and generate dependency information
brew "findent"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Generate pixel-perfect macOS folder icons in the native style
brew "folderify"
# Command-line fuzzy finder written in Go
brew "fzf"
# Fast, simple fuzzy text selector with an advanced scoring algorithm
brew "fzy"
# Open-source, cross-platform JavaScript runtime environment
brew "node"
# Interact with Google Gemini AI models from the command-line
brew "gemini-cli"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Quickly rewrite git repository history
brew "git-filter-repo"
# Git extension for versioning large files
brew "git-lfs"
# GitHub Model Context Protocol server for AI tools
brew "github-mcp-server"
# Render markdown on the CLI
brew "glow"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Language server for the Go language
brew "gopls"
# Grammar Checker for Developers
brew "harper"
# Bash and zsh history suggest box
brew "hstr"
# Website copier/offline browser
brew "httrack"
# Add GitHub support to git on the command-line
brew "hub"
# Client library for huggingface.co hub
brew "huggingface-cli"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Lazier way to manage everything docker
brew "lazydocker"
# Simple terminal UI for git commands
brew "lazygit"
# Curses-based tool for viewing and analyzing log files
brew "lnav"
# Rainbows and unicorns in your console!
brew "lolcat"
# Clone of ls with colorful output, file type icons, and more
brew "lsd"
# Powerful, lightweight programming language
brew "lua"
# Package manager for the Lua programming language
brew "luarocks"
# Generate a markdown TOC (table of contents) with Remarkable
brew "markdown-toc"
# Fast, flexible, config-based cli for linting Markdown/CommonMark files
brew "markdownlint-cli2"
# Mac App Store command-line interface
brew "mas"
# Remote terminal application
brew "mosh"
# Tail multiple files in one terminal simultaneously
brew "multitail"
# Clean C library for processing UTF-8 Unicode data
brew "utf8proc", args: ["HEAD"]
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# General purpose programming language in the ML family
brew "ocaml"
# Adds an OCR text layer to scanned PDF files
brew "ocrmypdf"
# Prompt theme engine for any shell
brew "oh-my-posh"
# Create, run, and share large language models (LLMs)
brew "ollama", restart_service: :changed
# OCaml package manager
brew "opam"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# AI coding agent, built for the terminal
brew "opencode"
# Open source computer vision library
brew "opencv"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Highly capable, feature-rich programming language
brew "perl"
# General-purpose scripting language
brew "php", restart_service: :changed
# Execute binaries from Python packages in isolated environments
brew "pipx"
# Fast, disk space efficient package manager
brew "pnpm"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Code formatter for JavaScript, CSS, JSON, GraphQL, Markdown, YAML
brew "prettier"
# Prettier daemon
brew "prettierd"
# Data validation using Python type hints
brew "pydantic"
# Python version management
brew "pyenv"
# Generic syntax highlighter
brew "pygments"
# Interpreted, interactive, object-oriented programming language
brew "python@3.12"
# Interpreted, interactive, object-oriented programming language
brew "python@3.13"
# Simple, modern, secure file encryption
brew "rage"
# Reattach process (e.g., tmux) to background
brew "reattach-to-user-namespace"
# Powerful, clean, object-oriented scripting language
brew "ruby"
# Experimental Rust compiler front-end for IDEs
brew "rust-analyzer"
# Bash completion for rustc
brew "rustc-completion"
# Rust toolchain installer
brew "rustup"
# 7-Zip is a file archiver with a high compression ratio
brew "sevenzip"
# Autoformat shell script source code
brew "shfmt"
# Ruby language server
brew "solargraph"
# Tool to create intelligent and beautiful documentation
brew "sphinx-doc"
# SQL linter and auto-formatter for Humans
brew "sqlfluff"
# Modern and pretty fancy file manager for the terminal
brew "superfile"
# TUI to view and query tabular files (CSV,TSV, Parquet, etc.)
brew "tabiew"
# Feature-rich console based todo list manager
brew "task"
# Tool for taking notes and open urls with taskwarrior
brew "taskopen"
# Terminal user interface for taskwarrior
brew "taskwarrior-tui"
# TUI interface for LLMs written in Rust
brew "tenere"
# Command-line time tracking application
brew "timewarrior"
# Terminal multiplexer
brew "tmux"
# Lightweight BitTorrent client
brew "transmission-cli", restart_service: :changed
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Network diagnostic tool, inspired by mtr
brew "trippy"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Simple terminal image viewer written in Rust
brew "viu"
# Test compatibility of VT100-compatible terminals
brew "vttest"
# Internet file retriever
brew "wget"
# Lexical database for the English language
brew "wordnet"
# Access X11 clipboards from the command-line
brew "xclip"
# Command-line program for getting and setting the contents of the X selection
brew "xsel"
# JavaScript package manager
brew "yarn"
# Blazing fast terminal file manager written in Rust, based on async I/O
brew "yazi"
# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "yq"
# Feature-rich command-line audio/video downloader
brew "yt-dlp"
# Programming language designed for robustness, optimality, and clarity
brew "zig"
# Compression and file packaging/archive utility
brew "zip"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# UNIX shell (command interpreter)
brew "zsh"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Feature-rich syntax highlighting for Zsh
brew "zsh-fast-syntax-highlighting"
# Zsh port of Fish shell's history search
brew "zsh-history-substring-search"
# Better and friendly vi(vim) mode plugin for ZSH
brew "zsh-vi-mode"
# A tiling window manager for macOS based on binary space partitioning.
brew "koekeishiya/formulae/yabai"
# GNU compiler collection for AVR 8-bit and 32-bit Microcontrollers
brew "osx-cross/avr/avr-gcc@8"
# Quantum Mechanical Keyboard (QMK) Firmware
brew "qmk/qmk/qmk"
# A claude code wrapper that saves your conversation history to markdown
brew "specstoryai/tap/specstory"
# Command-line interface for 1Password
cask "1password-cli"
# Edit and manage bibliographies
cask "bibdesk"
# E-books management software
cask "calibre"
# OpenAI's coding agent that runs in your terminal
cask "codex"
# AI assistant
cask "deepchat"
cask "font-hack-nerd-font"
cask "font-sf-mono-nerd-font-ligaturized"
cask "font-symbols-only-nerd-font"
# GIT client
cask "fork"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Free and open-source image editor
cask "gimp"
# Desktop automation application
cask "hammerspoon"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Keyboard customiser
cask "karabiner-elements"
# Graphical interface for LaTeX
cask "latexit"
# Full TeX Live distribution with GUI applications
cask "mactex"
# Minimal installer for conda
cask "miniconda"
# Toolbox companion for QMK Firmware
cask "qmk-toolbox"
# Tool that provides consistent, highly configurable symbols for apps
cask "sf-symbols"
# Real time file synchronisation software
cask "syncthing-app"
# Graphical user interface for TeX Live Manager
cask "tex-live-utility"
# LaTeX and TeX editor and previewer
cask "texshop"
# Keyboard configurator
cask "via"
# Configurator of compatible keyboards in real time
cask "vial"
# Multimedia player
cask "vlc"
# Remote desktop application focusing on security
cask "vnc-viewer"
# Binary releases of VS Code without MS branding/telemetry/licensing
cask "vscodium"
# GPU-accelerated cross-platform terminal emulator and multiplexer
cask "wezterm"
mas "1Password for Safari", id: 1569813296
mas "Acorn", id: 6737921844
mas "Actions", id: 1586435171
mas "Aiko", id: 1672085276
mas "AlignmentForXcode", id: 1168397789
mas "Anybox", id: 1593408455
mas "Audiobook Wizard", id: 460967298
mas "Blackmagic Disk Speed Test", id: 425264550
mas "Brother P-touch Editor", id: 1453365242
mas "Cardhop", id: 1290358394
mas "Cheatsheet", id: 1468213484
mas "CleanMyDrive 2", id: 523620159
mas "Coin Stats", id: 1387758574
mas "CoinStats", id: 1498417304
mas "Collections", id: 1568395334
mas "Darkroom", id: 953286746
mas "Data Jar", id: 1453273600
mas "Developer", id: 640199958
mas "Easy CSV Editor", id: 1171346381
mas "Encrypto", id: 935235287
mas "Fantastical", id: 975937182
mas "Goodnotes", id: 1444383602
mas "Ground News", id: 1324203419
mas "HP", id: 1474276998
mas "iA Writer", id: 775737590
mas "IconizeFolder", id: 6478772538
mas "iMovie", id: 408981434
mas "Infuse", id: 1136220934
mas "JSON Editor", id: 567740330
mas "Keynote", id: 409183694
mas "Kiwix", id: 997079563
mas "MenuBox", id: 6463440793
mas "NoNoise", id: 6755174608
mas "NordVPN", id: 905953485
mas "Notability", id: 360593530
mas "Numbers", id: 409203825
mas "OmniFocus", id: 1542143627
mas "Pages", id: 409201541
mas "PCalc", id: 403504866
mas "Photomator", id: 1444636541
mas "PLIST Editor", id: 1157491961
mas "Reeder", id: 6475002485
mas "Rules", id: 6461118886
mas "Save to Medium", id: 1485294824
mas "Scratchpad", id: 6504040051
mas "Shazam", id: 897118787
mas "Shortery", id: 1594183810
mas "ShutterCount", id: 720123827
mas "SimpleumSafe", id: 1547771496
mas "Slack", id: 803453959
mas "Speedtest", id: 1153157709
mas "Texifier", id: 458866234
mas "The Unarchiver", id: 425424353
mas "Tot", id: 1491071483
mas "Userscripts", id: 1463298887
mas "WhatsApp", id: 310633997
mas "Xcode", id: 497799835
