tap "acsandmann/tap"
tap "arimxyer/tap"
tap "brewforge/extras"
tap "felixkratz/formulae"
tap "gromgit/brewtils"
tap "koekeishiya/formulae"
tap "netmute/tap"
tap "osx-cross/arm"
tap "osx-cross/avr"
tap "qmk/qmk"
tap "rtk-ai/tap"
tap "shaunsingh/sfmono-nerd-font-ligaturized"
tap "specstoryai/tap"
# Simple, modern, secure file encryption
brew "age"
# Code searching, linting, rewriting
brew "ast-grep"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Bash scripts that integrate bat with various command-line tools
brew "bat-extras"
# Python code formatter
brew "black"
# Terminal EPUB Book Reader
brew "bookokrat"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# C/C++/ObjC language server
brew "ccls"
# GNU compiler collection
brew "gcc"
# LLVM's OpenMP runtime library
brew "libomp"
# Versatile and fast Unicode/ASCII/ANSI graphics renderer
brew "chafa"
# TUI web browser with CSS, inline image and JavaScript support
brew "chawan"
# General purpose syntax highlighter in pure Go
brew "chroma"
# Cut, copy, and paste anything, anywhere, all from the terminal
brew "clipboard"
# GNU CLISP, a Common Lisp implementation
brew "clisp"
# Dynamic, general-purpose programming language
brew "clojure"
# Language Server (LSP) for Clojure
brew "clojure-lsp"
# Cross-platform make
brew "cmake"
# Documentation for CMake
brew "cmake-docs"
# Open-source, cross-platform JavaScript runtime environment
brew "node"
# Up-to-date code documentation for LLMs and AI code editors
brew "context7-mcp", link: false
# GNU File, Shell, and Text utilities
brew "coreutils"
# Get, unpack, build, and install modules from CPAN
brew "cpanminus"
# Command-line csv viewer
brew "csvlens"
# Maintained ctags implementation
brew "universal-ctags"
# LSP implementation using universal-ctags as backend
brew "ctags-lsp"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Secure runtime for JavaScript and TypeScript
brew "deno"
# Load/unload environment variables based on $PWD
brew "direnv"
# Tool for exploring each layer in a docker image
brew "dive"
# Text processing system for reStructuredText
brew "docutils"
# Convert text between DOS, UNIX, and Mac formats
brew "dos2unix"
# Functional metaprogramming aware language built on Erlang VM
brew "elixir"
# Language Server and Debugger for Elixir
brew "elixir-ls"
# Perl lib for reading and writing EXIF metadata
brew "exiftool"
# XML 1.0 parser
brew "expat"
# Modern, maintained replacement for ls
brew "eza"
# Like neofetch, but much faster because written mostly in C
brew "fastfetch"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Text mode browser and Gemini, NNTP, FTP, Gopher, Finger, and BitTorrent client
brew "felinks"
# Play, record, convert, and stream select audio and video codecs
brew "ffmpeg"
# Banner-like program prints strings as ASCII art
brew "figlet"
# Utility to determine file types
brew "file-formula"
# Indent and beautify Fortran sources and generate dependency information
brew "findent"
# Tools and libraries to manipulate images in select formats
brew "imagemagick"
# Generate pixel-perfect macOS folder icons in the native style
brew "folderify"
# Language Server for Fortran
brew "fortran-language-server"
# Free Pascal: multi-architecture Pascal compiler
brew "fpc"
# Command-line fuzzy finder written in Go
brew "fzf"
# Fast, simple fuzzy text selector with an advanced scoring algorithm
brew "fzy"
# GitHub command-line tool
brew "gh"
# Glorious Glasgow Haskell Compilation System
brew "ghc"
# Distributed revision control system
brew "git"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Quickly rewrite git repository history
brew "git-filter-repo"
# Git extension for versioning large files
brew "git-lfs"
# Render markdown on the CLI
brew "glow"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Language server for the Go language
brew "gopls"
# Grammar Checker for Developers
brew "harper"
# Integration point for ghcide and haskell-ide-engine. One IDE to rule them all
brew "haskell-language-server"
# Cross-platform program for developing Haskell projects
brew "haskell-stack"
# Bash and zsh history suggest box
brew "hstr"
# Website copier/offline browser
brew "httrack"
# Add GitHub support to git on the command-line
brew "hub"
# Client library for huggingface.co hub
brew "huggingface-cli"
# Command-line benchmarking tool
brew "hyperfine"
# Parser generator for use with Java applications
brew "javacc"
# Java language specific implementation of the Language Server Protocol
brew "jdtls"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Lazier way to manage everything docker
brew "lazydocker"
# Simple terminal UI for git commands
brew "lazygit"
# TUI for logs from journalctl, file system, Docker, Podman and Kubernetes pods
brew "lazyjournal"
# Cross-platform TUI database management tool
brew "lazysql"
# SIXEL encoder/decoder implementation
brew "libsixel"
# Find what models run on your hardware
brew "llmfit"
# Curses-based tool for viewing and analyzing log files
brew "lnav"
# Rainbows and unicorns in your console!
brew "lolcat"
# Clone of ls with colorful output, file type icons, and more
brew "lsd"
# LTeX+ Language Server: maintained fork of LTeX Language Server
brew "ltex-ls-plus"
# Powerful, lightweight programming language
brew "lua"
# Language Server for the Lua language
brew "lua-language-server"
# Package manager for the Lua programming language
brew "luarocks"
# Drop-in replacement for MySQL
brew "mariadb", restart_service: :changed
# Generate a markdown TOC (table of contents) with Remarkable
brew "markdown-toc"
# Fast, flexible, config-based cli for linting Markdown/CommonMark files
brew "markdownlint-cli2"
# Mac App Store command-line interface
brew "mas"
# Remote terminal application
brew "mosh"
# Tail multiple files in one terminal simultaneously
brew "multitail"
# Clean C library for processing UTF-8 Unicode data
brew "utf8proc", args: ["HEAD"]
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# General purpose programming language in the ML family
brew "ocaml"
# Data validation using Python type hints
brew "pydantic"
# Adds an OCR text layer to scanned PDF files
brew "ocrmypdf"
# Programming language with focus on simplicity, performance and modern systems
brew "odin"
# Prompt theme engine for any shell
brew "oh-my-posh"
# Create, run, and share large language models (LLMs)
brew "ollama", restart_service: :changed
# OCaml package manager
brew "opam"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# AI coding agent, built for the terminal
brew "opencode"
# Open source computer vision library
brew "opencv"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Highly capable, feature-rich programming language
brew "perl"
# General-purpose scripting language
brew "php", restart_service: :changed
# Execute binaries from Python packages in isolated environments
brew "pipx"
# Fast, disk space efficient package manager
brew "pnpm"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Code formatter for JavaScript, CSS, JSON, GraphQL, Markdown, YAML
brew "prettier"
# Prettier daemon
brew "prettierd"
# Python version management
brew "pyenv"
# Generic syntax highlighter
brew "pygments"
# Static type checker for Python
brew "pyright"
# Interpreted, interactive, object-oriented programming language
brew "python@3.12"
# Interpreted, interactive, object-oriented programming language
brew "python@3.13"
# Simple, modern, secure file encryption
brew "rage"
# Reattach process (e.g., tmux) to background
brew "reattach-to-user-namespace"
# Powerful, clean, object-oriented scripting language
brew "ruby"
# Opinionated language server for Ruby
brew "ruby-lsp"
# Experimental Rust compiler front-end for IDEs
brew "rust-analyzer"
# Bash completion for rustc
brew "rustc-completion"
# Rust toolchain installer
brew "rustup"
# JVM-based programming language
brew "scala"
# 7-Zip is a file archiver with a high compression ratio
brew "sevenzip"
# Autoformat shell script source code
brew "shfmt"
# Ruby language server
brew "solargraph"
# Tool to create intelligent and beautiful documentation
brew "sphinx-doc"
# SQL linter and auto-formatter for Humans
brew "sqlfluff"
# Modern and pretty fancy file manager for the terminal
brew "superfile"
# High-performance system programming language
brew "swift"
# TUI to view and query tabular files (CSV,TSV, Parquet, etc.)
brew "tabiew"
# Feature-rich console based todo list manager
brew "task"
# Tool for taking notes and open urls with taskwarrior
brew "taskopen"
# Terminal user interface for taskwarrior
brew "taskwarrior-tui"
# TUI interface for LLMs written in Rust
brew "tenere"
# Command-line time tracking application
brew "timewarrior"
# Terminal multiplexer
brew "tmux"
# Lightweight BitTorrent client
brew "transmission-cli", restart_service: :changed
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Incremental parsing library
brew "tree-sitter"
# Parser generator tool
brew "tree-sitter-cli"
# Network diagnostic tool, inspired by mtr
brew "trippy"
# Interactive SQL shell for Turso
brew "turso"
# Language Server Protocol implementation for TypeScript wrapping tsserver
brew "typescript-language-server"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Simple terminal image viewer written in Rust
brew "viu"
# Generator for LS_COLORS with support for multiple color themes
brew "vivid"
# Test compatibility of VT100-compatible terminals
brew "vttest"
# Internet file retriever
brew "wget"
# Lexical database for the English language
brew "wordnet"
# Access X11 clipboards from the command-line
brew "xclip"
# Swift tool to parse xcodebuild output for coding agents
brew "xcsift"
# Command-line program for getting and setting the contents of the X selection
brew "xsel"
# JavaScript package manager
brew "yarn"
# Blazing fast terminal file manager written in Rust, based on async I/O
brew "yazi"
# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "yq"
# Feature-rich command-line audio/video downloader
brew "yt-dlp"
# Programming language designed for robustness, optimality, and clarity
brew "zig"
# Compression and file packaging/archive utility
brew "zip"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# UNIX shell (command interpreter)
brew "zsh"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Feature-rich syntax highlighting for Zsh
brew "zsh-fast-syntax-highlighting"
# Zsh port of Fish shell's history search
brew "zsh-history-substring-search"
# Better and friendly vi(vim) mode plugin for ZSH
brew "zsh-vi-mode"
# Tiling window manager for macOS
brew "acsandmann/tap/rift"
# Fast CLI and TUI for browsing AI model information from models.dev
brew "arimxyer/tap/models"
# A window border system for macOS
brew "felixkratz/formulae/borders"
# Interactive TUI for Homebrew
brew "gromgit/brewtils/taproom"
# GNU compiler collection for AVR 8-bit and 32-bit Microcontrollers
brew "osx-cross/avr/avr-gcc@8"
# Quantum Mechanical Keyboard (QMK) Firmware
brew "qmk/qmk/qmk"
# Rust Token Killer - High-performance CLI proxy to minimize LLM token consumption
brew "rtk-ai/tap/rtk"
# Command-line interface for 1Password
cask "1password-cli"
# Data backup and storage service
cask "backblaze"
# Edit and manage bibliographies
cask "bibdesk"
# E-books management software
cask "calibre"
# Anthropic's official Claude AI desktop app
cask "claude"
# Digital photo manager
cask "digikam"
cask "font-hack-nerd-font"
cask "font-sf-mono-nerd-font-ligaturized"
cask "font-symbols-only-nerd-font"
# GIT client
cask "fork"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Free and open-source image editor
cask "gimp"
# Desktop automation application
cask "hammerspoon"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Keyboard customiser
cask "karabiner-elements"
# Graphical interface for LaTeX
cask "latexit"
# Full TeX Live distribution with GUI applications
cask "mactex"
# Minimal installer for conda
cask "miniconda"
# Toolbox companion for QMK Firmware
cask "qmk-toolbox"
# Tool that provides consistent, highly configurable symbols for apps
cask "sf-symbols"
# Screenshot measurement and annotation tool
cask "shottr"
# Real time file synchronisation software
cask "syncthing-app"
# Graphical user interface for TeX Live Manager
cask "tex-live-utility"
# LaTeX and TeX editor and previewer
cask "texshop"
# Create, maintain, and interact with Xcode projects at scale
cask "tuist"
# Keyboard configurator
cask "via"
# Configurator of compatible keyboards in real time
cask "vial"
# Multimedia player
cask "vlc"
# Remote desktop application focusing on security
cask "vnc-viewer"
# Binary releases of VS Code without MS branding/telemetry/licensing
cask "vscodium"
# GPU-accelerated cross-platform terminal emulator and multiplexer
cask "wezterm"
