1password-cli
amethyst
backblaze
bibdesk
calibre
claude
codex
font-hack-nerd-font
font-sf-mono-nerd-font-ligaturized
font-symbols-only-nerd-font
fork
ghostty
gimp
hammerspoon
iterm2
karabiner-elements
latexit
macpulse
mactex
miniconda
qmk-toolbox
sf-symbols
syncthing-app
taphouse
tex-live-utility
texshop
tuist
via
vial
vlc
vnc-viewer
vscodium
wezterm
