age
aider
ast-grep
automake
bat
bat-extras
black
broot
btop
ccls
chafa
chezmoi
chroma
cmake
cmake-docs
composer
deno
direnv
dive
docutils
expat
fastfetch
fd
felixkratz/formulae/borders
ffmpeg
figlet
file-formula
findent
fish
fzf
fzy
gh
git
git-delta
gitu
gitui
glow
gnu-sed
go
gopls
harper
helix
hstr
httrack
hub
huggingface-cli
icu4c@76
imagemagick
jq
julia
koekeishiya/formulae/yabai
lazydocker
lazygit
lf
lnav
lolcat
luarocks
markdown-toc
markdownlint-cli2
mas
micromamba
mosh
multitail
ncdu
neovim
netmute/tap/ctags-lsp
nushell
ocaml
oh-my-posh
ollama
opam
pandoc
perl
pipx
pnpm
poppler
prettier
prettierd
pyenv
pygments
python-packaging
python@3.9
qmk/qmk/qmk
rage
reattach-to-user-namespace
ripgrep
rust
rust-analyzer
rustc-completion
sevenzip
shfmt
showkey
sk
solargraph
sphinx-doc
sqlfluff
superfile
syncthing
tabiew
taskopen
taskwarrior-tui
television
tenere
the_silver_searcher
timewarrior
tmux
transmission-cli
tree
trippy
utf8proc
uv
viu
vttest
wget
wordnet
xclip
xsel
yarn
yazi
yq
yt-dlp
zig
zip
zoxide
zsh
zsh-autosuggestions
zsh-fast-syntax-highlighting
zsh-history-substring-search
zsh-vi-mode
