1password
1password-cli
adobe-acrobat-reader
alfred
anytype
backblaze
bibdesk
calibre
chronosync
daisydisk
devonagent
devonthink
discord
docker
dropbox
epic-games
espanso
firefox
font-hack-nerd-font
font-sf-mono-nerd-font-ligaturized
font-symbols-only-nerd-font
fork
ghostty
gimp
google-chrome
google-drive
grammarly-desktop
iterm2
jabra-direct
jordanbaird-ice
karabiner-elements
keyboard-maestro
keycue
latexit
logi-options+
logseq
lulu
mactex
miniconda
monarch
moom
nextcloud
notion
obsidian
ollama
ollamac
omnifocus
omnigraffle
omnioutliner
omniplan
only-switch
parallels
parallels-toolbox
plus42-decimal
qmk-toolbox
setapp
sf-symbols
snagit
soundsource
spamsieve
steam
tageditor
taskwarrior-pomodoro
tex-live-utility
texshop
thunderbird
tradingview
transmission
transmit
trezor-suite
via
vlc
vnc-viewer
vscodium
wezterm
wins
zed
zen-browser
zen-browser@twilight
